---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionType
source: html/1765eae5-5724-05cf-9308-6aa845a52b1b.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionType Property

Identifies what type of bend diameter dimensions will be shown (radial or diameter).

## Syntax (C#)
```csharp
public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration